Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33f/h/p33FJ64GP310A.h
#define _T4CON_TCS_POSITION                      0x00000001
#define _T4CON_TCS_MASK                          0x00000002
#define _T4CON_TCS_LENGTH                        0x00000001

#define _T4CON_T32_POSITION                      0x00000003
#define _T4CON_T32_MASK                          0x00000008
#define _T4CON_T32_LENGTH                        0x00000001

#define _T4CON_TCKPS_POSITION                    0x00000004
#define _T4CON_TCKPS_MASK                        0x00000030
#define _T4CON_TCKPS_LENGTH                      0x00000002

#define _T4CON_TGATE_POSITION                    0x00000006
#define _T4CON_TGATE_MASK                        0x00000040
#define _T4CON_TGATE_LENGTH                      0x00000001

#define _T4CON_TSIDL_POSITION                    0x0000000D
#define _T4CON_TSIDL_MASK                        0x00002000
#define _T4CON_TSIDL_LENGTH                      0x00000001

#define _T4CON_TON_POSITION                      0x0000000F
#define _T4CON_TON_MASK                          0x00008000
#define _T4CON_TON_LENGTH                        0x00000001

#define _T4CON_TCKPS0_POSITION                   0x00000004
#define _T4CON_TCKPS0_MASK                       0x00000010
#define _T4CON_TCKPS0_LENGTH                     0x00000001

#define _T4CON_TCKPS1_POSITION                   0x00000005
#define _T4CON_TCKPS1_MASK                       0x00000020
#define _T4CON_TCKPS1_LENGTH                     0x00000001

#define _T5CON_TCS_POSITION                      0x00000001
#define _T5CON_TCS_MASK                          0x00000002
#define _T5CON_TCS_LENGTH                        0x00000001

#define _T5CON_TCKPS_POSITION                    0x00000004
#define _T5CON_TCKPS_MASK                        0x00000030
#define _T5CON_TCKPS_LENGTH                      0x00000002

#define _T5CON_TGATE_POSITION                    0x00000006
#define _T5CON_TGATE_MASK                        0x00000040
#define _T5CON_TGATE_LENGTH                      0x00000001

#define _T5CON_TSIDL_POSITION                    0x0000000D
#define _T5CON_TSIDL_MASK                        0x00002000
#define _T5CON_TSIDL_LENGTH                      0x00000001

#define _T5CON_TON_POSITION                      0x0000000F
#define _T5CON_TON_MASK                          0x00008000
#define _T5CON_TON_LENGTH                        0x00000001

#define _T5CON_TCKPS0_POSITION                   0x00000004
#define _T5CON_TCKPS0_MASK                       0x00000010
#define _T5CON_TCKPS0_LENGTH                     0x00000001

#define _T5CON_TCKPS1_POSITION                   0x00000005
#define _T5CON_TCKPS1_MASK                       0x00000020
#define _T5CON_TCKPS1_LENGTH                     0x00000001

#define _T6CON_TCS_POSITION                      0x00000001
#define _T6CON_TCS_MASK                          0x00000002
#define _T6CON_TCS_LENGTH                        0x00000001

#define _T6CON_T32_POSITION                      0x00000003
#define _T6CON_T32_MASK                          0x00000008
#define _T6CON_T32_LENGTH                        0x00000001

#define _T6CON_TCKPS_POSITION                    0x00000004
#define _T6CON_TCKPS_MASK                        0x00000030
#define _T6CON_TCKPS_LENGTH                      0x00000002

#define _T6CON_TGATE_POSITION                    0x00000006
#define _T6CON_TGATE_MASK                        0x00000040
#define _T6CON_TGATE_LENGTH                      0x00000001

#define _T6CON_TSIDL_POSITION                    0x0000000D
#define _T6CON_TSIDL_MASK                        0x00002000
#define _T6CON_TSIDL_LENGTH                      0x00000001

#define _T6CON_TON_POSITION                      0x0000000F
#define _T6CON_TON_MASK                          0x00008000
#define _T6CON_TON_LENGTH                        0x00000001

#define _T6CON_TCKPS0_POSITION                   0x00000004
#define _T6CON_TCKPS0_MASK                       0x00000010
#define _T6CON_TCKPS0_LENGTH                     0x00000001

#define _T6CON_TCKPS1_POSITION                   0x00000005
#define _T6CON_TCKPS1_MASK                       0x00000020
#define _T6CON_TCKPS1_LENGTH                     0x00000001

#define _T7CON_TCS_POSITION                      0x00000001
#define _T7CON_TCS_MASK                          0x00000002
#define _T7CON_TCS_LENGTH                        0x00000001

#define _T7CON_TCKPS_POSITION                    0x00000004
#define _T7CON_TCKPS_MASK                        0x00000030
#define _T7CON_TCKPS_LENGTH                      0x00000002

#define _T7CON_TGATE_POSITION                    0x00000006
#define _T7CON_TGATE_MASK                        0x00000040
#define _T7CON_TGATE_LENGTH                      0x00000001

#define _T7CON_TSIDL_POSITION                    0x0000000D
#define _T7CON_TSIDL_MASK                        0x00002000
#define _T7CON_TSIDL_LENGTH                      0x00000001

#define _T7CON_TON_POSITION                      0x0000000F
#define _T7CON_TON_MASK                          0x00008000
#define _T7CON_TON_LENGTH                        0x00000001

#define _T7CON_TCKPS0_POSITION                   0x00000004
#define _T7CON_TCKPS0_MASK                       0x00000010
#define _T7CON_TCKPS0_LENGTH                     0x00000001

#define _T7CON_TCKPS1_POSITION                   0x00000005
#define _T7CON_TCKPS1_MASK                       0x00000020
#define _T7CON_TCKPS1_LENGTH                     0x00000001

#define _T8CON_TCS_POSITION                      0x00000001
#define _T8CON_TCS_MASK                          0x00000002
#define _T8CON_TCS_LENGTH                        0x00000001

#define _T8CON_T32_POSITION                      0x00000003
#define _T8CON_T32_MASK                          0x00000008
#define _T8CON_T32_LENGTH                        0x00000001

#define _T8CON_TCKPS_POSITION                    0x00000004
#define _T8CON_TCKPS_MASK                        0x00000030
#define _T8CON_TCKPS_LENGTH                      0x00000002

#define _T8CON_TGATE_POSITION                    0x00000006
#define _T8CON_TGATE_MASK                        0x00000040
#define _T8CON_TGATE_LENGTH                      0x00000001

#define _T8CON_TSIDL_POSITION                    0x0000000D
#define _T8CON_TSIDL_MASK                        0x00002000
#define _T8CON_TSIDL_LENGTH                      0x00000001

